---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.ConceptualConstructionType
source: html/15362f08-3d1f-fd06-1c2d-363354444bf2.htm
---
# ConceptualConstructionType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.